app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "picture_id") VALUES ('yeah', 1)
---
  def create
  	@picture = Picture.get(params[:comment][:picture_id])
  	@picture.comments << Comment.new(params[:comment])