app/controllers/pictures_controller.rb

SELECT COUNT(*) FROM "pictures"
---
  def index
    @pictures = Picture.paginate(:page => params[:page], :per_page => 2)

INSERT INTO "pictures" ("title", "description", "file") VALUES ('teste', 'teste', '27-zJxKHhO.jpg')
---
  def create
    @picture = Picture.new(params[:picture])

    respond_to do |format|
      if @picture.save

UPDATE "pictures" SET "description" = 'testessssss' WHERE "id" = 1
---
  def update
    @picture = Picture.get(params[:id])

    respond_to do |format|
      if @picture.update(params[:picture])